import { View, SafeAreaView, ScrollView, LayoutAnimation } from "react-native";
import React, { useState, useEffect, useRef } from "react";
import { cn } from "~/lib/utils";
import { CONTAINER } from "~/constants/Styles";
import { Text } from "~/components/ui/text";
import { PARAGRAPH, TITLE } from "~/constants/Typography";
import { Term } from "~/types/term";
import { Card, CardDescription, CardFooter } from "~/components/ui/card";
import { ArrowLeft, ArrowRight, ArrowDown } from "lucide-react-native";
import { IconButton } from "~/components/icon-button";
import { useRouter, useLocalSearchParams } from "expo-router";
import {
  Feedback,
  FeedbackDescription,
  FeedbackTitle,
} from "~/components/ui/feedback";
import useUserStore from "~/store/use-user-store";
import { createUser } from "~/api/auth/create-user";
import { patchUser } from "~/api/auth/patch-user";
import { postProfile } from "~/api/auth/post-profile";
import { Button } from "~/components/ui/button";

const demodata: Term = {
  description: (
    <>
      แอปพลิเคชัน OK moneys (ซึ่งต่อไปนี้จะเรียกว่า "ผู้ให้บริการ")
      ให้ความคุ้มครองและปฏิบัติต่อข้อมูลส่วนบุคคลของผู้รับบริการ
      (ซึ่งต่อไปนี้เรียกว่า "ผู้รับบริการ" หรือ "เจ้าของข้อมูลส่วนบุคคล")
      โดยสอดคล้องกับกฎหมายว่าด้วยการคุ้มครองข้อมูลส่วนบุคคล
      ผู้ให้บริการจึงได้กำหนดแบบแจ้งเกี่ยวกับข้อมูลส่วนบุคคลฉบับนี้ขึ้นเพื่อแจ้งให้ผู้รับบริการและผู้ที่เกี่ยวข้องทราบรายละเอียดการดำเนินการกับข้อมูลส่วนบุคคลไม่ว่าจะเป็นการเก็บรวบรวม
      ใช้ และเปิดเผย (โดยรวมเรียกว่า "การประมวลผล") ซึ่งอาจเกิดขึ้น
      ตลอดจนแจ้งให้ท่านทราบถึงสิทธิในข้อมูลส่วนบุคคลของท่านตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล
      พ.ศ. 2562 คำนิยาม "ผู้ให้บริการ" หมายถึง แอปพลิเคชัน OK moneys "บุคคล"
      หมายถึง บุคคลธรรมดาที่ยังไม่ถึงแก่กรรม "ประมวลผล" หมายถึง
      กระบวนการดำเนินการใด ๆ ที่กระทำกับข้อมูลส่วนบุคคล เช่น การเก็บรวบรวม
      การบันทึก การจัดการอย่างเป็นระบบ การจัดโครงสร้าง การประยุกต์ การแก้ไข
      การกู้คืน การให้คำปรึกษา การใช้ การเปิดเผยด้วยการส่ง
      การเปิดเผยด้วยการเผยแพร่หรือเข้าถึงได้โดยวิธีอื่นใด การรวมข้อมูล การจำกัด
      การลบหรือทำลาย เป็นต้น "ข้อมูลส่วนบุคคล" หมายถึง
      ข้อมูลเกี่ยวกับบุคคลซึ่งทำให้สามารถระบุตัวบุคคลนั้นได้
      ไม่ว่าทางตรงหรือทางอ้อม แต่ไม่รวมถึงข้อมูลของผู้ถึงแก่กรรม
      "ข้อมูลส่วนบุคคลที่มีความอ่อนไหว" หมายถึง ข้อมูลส่วนบุคคลเกี่ยวกับ
      เชื้อชาติ เผ่าพันธุ์ ความคิดเห็นทางการเมือง ความเชื่อในลัทธิ
      ศาสนาหรือปรัชญา พฤติกรรมทางเพศ ประวัติอาชญากรรม ข้อมูลสุขภาพ
      ข้อมูลความพิการ ข้อมูลสหภาพแรงงาน ข้อมูลพันธุกรรม ข้อมูลชีวภาพ
      หรือข้อมูลอื่นใดซึ่งกระทบต่อเจ้าของข้อมูลส่วนบุคคลในทำนองเดียวกันตามที่คณะกรรมการคุ้มครองข้อมูลส่วนบุคคลประกาศกำหนด
      "เจ้าของข้อมูลส่วนบุคคล" หมายถึง บุคคลที่ข้อมูลส่วนบุคคลนั้นระบุไปถึง
      แต่ไม่ใช่กรณีที่บุคคลมีความเป็นเจ้าของข้อมูล (Ownership)
      หรือเป็นผู้สร้างหรือเก็บรวบรวมข้อมูลนั้นเอง
      เจ้าของข้อมูลส่วนบุคคลหมายถึงบุคคลธรรมดาเท่านั้น
      "ผู้ควบคุมข้อมูลส่วนบุคคล" หมายถึง
      บุคคลหรือนิติบุคคลซึ่งมีอำนาจหน้าที่ตัดสินใจเกี่ยวกับการประมวลผลข้อมูลส่วนบุคคล
      "ผู้ประมวลผลข้อมูลส่วนบุคคล" หมายถึง
      บุคคลหรือนิติบุคคลซึ่งดำเนินการเกี่ยวกับการประมวลผลข้อมูลส่วนบุคคลตามคำสั่งหรือในนามของผู้ควบคุมข้อมูลส่วนบุคคล
      ทั้งนี้
      บุคคลหรือนิติบุคคลซึ่งดำเนินการดังกล่าวไม่เป็นผู้ควบคุมข้อมูลส่วนบุคคล
      "เจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล" หมายถึง
      บุคคลหรือนิติบุคคลซึ่งบริษัทแต่งตั้งให้ทำหน้าที่เป็นเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคลตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล
      พ.ศ. 2562 "คำจำกัดความอื่น ๆ" หมายถึง
      ในกรณีที่ประกาศความเป็นส่วนตัวฉบับนี้ไม่ได้นิยามไว้
      คำนิยามให้เป็นไปตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562
      ข้อมูลส่วนบุคคลที่ผู้ให้บริการเก็บรวบรวม
      ในการเก็บรวบรวมและเก็บรักษาข้อมูลส่วนบุคคลผู้ให้บริการจะใช้วิธีการที่ชอบด้วยกฎหมายและจำกัดเพียงเท่าที่จำเป็นตามวัตถุประสงค์การดำเนินงานของผู้ให้บริการ
      ดังต่อไปนี้ ข้อมูลส่วนบุคคลทั่วไป ข้อมูลที่ใช้ระบุตัวตน เช่น ชื่อ นามสกุล
      เลขประจำตัวบัตรประชาชน เลขหนังสือเดินทาง วันเดือนปี เกิด เพศ อายุ สัญชาติ
      ลายมือชื่อ ภาพถ่าย ชื่อผู้ใช้งานระบบอิเล็กทรอนิกส์ เป็นต้น ข้อมูลติดต่อ
      เช่น ที่อยู่ สำเนาทะเบียนบ้าน เบอร์โทรศัพท์ เบอร์โทรสาร อีเมล
      ตำแหน่งที่อยู่ ผู้ติดต่อได้ในกรณีฉุกเฉิน บัญชีการใช้งานสื่อสังคมออนไลน์
      LINE ID เป็นต้น ข้อมูลทางการเงิน เช่น หมายเลขบัญชีธนาคาร เป็นต้น
      ข้อมูลการติดต่อกับผู้ให้บริการ เช่น ข้อมูลเกี่ยวกับวัน เวลา
      ข้อมูลการบันทึกภาพและ/หรือเสียงเมื่อมีการติดต่อกับผู้ให้บริการ เป็นต้น
      ความคิดเห็น ข้อเสนอแนะ ข้อร้องเรียน ข้อมูลส่วนบุคคลอื่น ๆ
      เพื่อการอำนวยความสะดวกตามจำเป็นตามสัญญาการให้บริการของผู้ให้บริการ
      ข้อมูลส่วนบุคคลที่มีความละเอียดอ่อน ข้อมูลชีวมาตร เช่น ระบบจดจำใบหน้า
      ลายนิ้วมือ เพื่อการเข้าถึงสถานที่/การสมัครใช้บริการ
      และการยืนยันและพิสูจน์ตัวบุคคล ข้อมูลส่วนบุคคลที่มีความละเอียดอ่อนอื่น ๆ
      เพื่อการอำนวยความสะดวกตามจำเป็นตามสัญญาการให้บริการของผู้ให้บริการ
      ผู้ให้บริการอาจได้รับข้อมูลบุคคลที่สามที่เกี่ยวข้องกับท่านโดยท่านเป็นผู้ให้ข้อมูลกับบริษัท
      เช่น บุคคลติดต่อกรณีฉุกเฉิน เป็นต้น
      ซึ่งบริษัทใช้ข้อมูลเพื่อติดต่อในกรณีฉุกเฉิน
      โปรดแจ้งประกาศความเป็นส่วนตัวฉบับนี้แก่บุคคลที่สามและขอความยินยอมจากบุคคลดังกล่าวหากจำเป็น
      เว้นแต่ว่ามีข้อยกเว้นตามกฎหมายที่ผู้ให้บริการไม่ต้องขอความยินยอม
      ประกาศความเป็นส่วนตัวนี้มีผลบังคับใช้กับใคร บุคคลธรรมดา เช่น
      ผู้รับบริการของผู้ให้บริการ ผู้ที่เป็นลูกค้า ผู้ที่เคยเป็นลูกค้า
      ลูกค้าในอดีต ลูกค้าปัจจุบัน ผู้ที่อาจจะเป็นลูกค้าในอนาคต บุคคลธรรมดาใด ๆ
      ที่ผู้ให้บริการได้รับข้อมูลส่วนบุคคลมา เช่น ผู้ค้ำประกัน
      ลูกหนี้ของผู้รับบริการ ผู้ติดต่อสอบถามบริษัทผ่านช่องทางต่าง ๆ
      ผู้ติดต่อในกรณีฉุกเฉิน คู่สมรส หรือบุคคลที่สามอื่น ๆ
      ที่เกี่ยวข้องกับผู้รับบริการ ระยะเวลาในการเก็บรวบรวมข้อมูลส่วนบุคคล
      ผู้ให้บริการจะเก็บรักษาข้อมูลส่วนบุคคลของท่านในระยะเวลาเท่าที่จำเป็นอย่างสมเหตุสมผล
      เพื่อให้บรรลุตามวัตถุประสงค์ที่บริษัทได้รับข้อมูลส่วนบุคคลนั้นมาตามที่ระบุไว้ในนโยบายความเป็นส่วนตัวฉบับนี้
      ซึ่งเมื่อพ้นระยะเวลาดังกล่าวผู้ให้บริการจะทำการ ลบ
      ทำลายข้อมูลส่วนบุคคลของท่านทุกช่องทางของผู้ให้บริการ
      วัตถุประสงค์ในการประมวลผลข้อมูลส่วนบุคคล
      วัตถุประสงค์ที่ผู้ให้บริการดำเนินการประมวลผลข้อมูลส่วนบุคคลของท่าน
      ผู้ให้บริการอาจอาศัยหรืออ้างฐานทางกฎหมาย ดังต่อไปนี้
      วัตถุประสงค์ที่ผู้ให้บริการดำเนินการประมวลผลข้อมูลส่วนบุคคลของผู้รับบริการ
      โดยอาศัยฐานความยินยอม เช่น เพื่อทำการตลาดและการติดต่อสื่อสาร การใช้บริการ
      การเสนอข้อเสนอพิเศษ การเสนอโปรโมชัน ส่วนลด สิทธิพิเศษ การแจ้งเตือน
      การแจ้งข่าวสารและข้อมูลเกี่ยวกับบริการจากผู้ให้บริการ
      รวมถึงผู้ให้บริการในเครือของ และ/หรือพันธมิตรทางธุรกิจ
      ที่ผู้ให้บริการไม่สามารถอาศัยฐานทางกฎหมายอื่นใดได้
      วัตถุประสงค์ที่ผู้ให้บริการดำเนินการประมวลผลข้อมูลส่วนบุคคลของท่านโดยอาศัยฐานทางกฎหมายอื่นโดยผู้ให้บริการอาจอาศัยหรืออ้าง
      (1) ฐานการปฏิบัติตามสัญญา
      สำหรับการเริ่มต้นทำสัญญาหรือการเข้าทำสัญญาหรือปฏิบัติตามสัญญากับผู้รับบริการ
      และ/หรือเพื่อเป็นข้อมูลในการบริหารจัดการธุรกรรมทางการเงิน
      และ/หรือเพื่อบริหารความสัมพันธ์ของผู้รับบริการและผู้ให้บริการ (2)
      ฐานการปฏิบัติตามกฎหมาย เพื่อการปฏิบัติหน้าที่ตามกฎหมายของผู้ให้บริการ (3)
      ฐานประโยชน์อันชอบธรรม เพื่อการก่อตั้งสิทธิเรียกร้องตามกฎหมาย
      การปฎิบัติตามหรือการยกขึ้นต่อสู้สิทธิเรียกร้องตามกฎหมาย
      หรือการยกขึ้นต่อสู้สิทธิเรียกร้องตามกฎหมาย
      การเปิดเผยข้อมูลส่วนบุคคลของผู้รับบริการ
      ผู้ให้บริการจะเก็บรักษาข้อมูลที่เกี่ยวกับผู้รับบริการไว้เป็นความลับและจะไม่ทำการเปิดเผย
      เว้นแต่กรณีที่ผู้ให้บริการมีความจำเป็น
      เพื่อให้สามารถบรรลุวัตถุประสงค์ในการเฝ้าระวังสังเกตการณ์ตามที่ได้ระบุในสัญญานี้
      ผู้ให้บริการอาจเปิดเผยข้อมูลแก่ประเภทของบุคคลหรือนิติบุคคลดังต่อไปนี้ (1)
      หน่วยงานที่มีอำนาจหน้าที่ตามที่กฎหมายกำหนด เพื่อช่วยเหลือ
      สนับสนุนในการบังคับใช้กฎหมาย หรือเพื่อการดำเนินการสืบสวน สอบสวน
      หรือการดำเนินคดีความต่าง ๆ (2) บุคคลภายนอก
      ซึ่งผู้ให้บริการอาจว่าจ้างบริษัทอื่น ตัวแทน
      หรือผู้รับจ้างในการให้บริการแก่ผู้ให้บริการ
      โดยผู้ให้บริการอาจเปิดเผยข้อมูลส่วนบุคคลของท่านไปยังผู้ให้บริการซึ่งเป็นบุคคลภายนอกเหล่านั้น
      ดังต่อไปนี้ ซึ่งรวมถึงแต่ไม่จำกัดเพียง 1. ผู้พัฒนาโครงสร้างพื้นฐาน
      อินเทอร์เน็ต เว็บไซต์ และผู้ให้บริการด้านดิจิทัล 2.
      ผู้ให้บริการการตรวจสอบบัญชี 3.
      ผู้ให้บริการด้านการจัดเก็บข้อมูลและบริการคลาวด์ 4.
      ผู้ให้บริการโปรแกรมสำเร็จรูป 5. ผู้ให้คำปรึกษาด้านต่าง ๆ เช่น ด้านการเงิน
      ด้านกฎหมาย ด้านเทคโนโลยีสารสนเทศ 6. บริษัทในเครือ คู่ค้า พันธมิตรทางธุรกิจ
      7. ผู้สนใจจะซื้อกิจการ 8. ผู้ให้บริการด้านการวิเคราะห์ข้อมูล
      การส่งหรือโอนข้อมูลส่วนบุคคลไปยังต่างประเทศ
      ผู้ให้บริการอาจส่งหรือโอนข้อมูลส่วนบุคคลของผู้รับบริการไปต่างประเทศในกรณีที่จำเป็นเพื่อปฏิบัติตามสัญญาที่ผู้รับบริการเป็นคู่สัญญา
      หรือเป็นการกระทำตามสัญญาระหว่างผู้ให้บริการกับบุคคลหรือนิติบุคคลอื่นเพื่อประโยชน์ของผู้รับบริการ
      หรือเพื่อใช้ในการดำเนินการตามคำขอของผู้รับบริการก่อนเข้าทำสัญญา
      หรือเพื่อป้องกันหรือระงับอันตรายต่อชีวิต ร่างกาย
      หรือสุขภาพของท่านหรือบุคคลอื่น เพื่อปฏิบัติตามกฎหมาย
      หรือเป็นการจำเป็นเพื่อดำเนินภารกิจเพื่อประโยชน์สาธารณะที่สำคัญ
      หรือขอความยินยอมจากผู้รับบริการ
      ผู้ให้บริการอาจเก็บข้อมูลของท่านไว้ในคอมพิวเตอร์ เซิร์ฟเวอร์ (Server)
      หรือระบบคลาวด์ (Cloud) ที่ให้บริการโดยบุคคลหรือนิติบุคคลอื่น
      และอาจใช้โปรแกรมหรือแอปพลิเคชันของบุคคลอื่นในรูปแบบของการให้บริการซอฟท์แวร์สำเร็จรูปและรูปแบบของการให้บริการแพลตฟอร์มสำเร็จรูปในการประมวลผลข้อมูลส่วนบุคคลของท่าน
      ทั้งนี้
      บริษัทจะไม่อนุญาตให้บุคคลที่ไม่เกี่ยวข้องสามารถเข้าถึงข้อมูลส่วนบุคคลได้
      และบริษัทจะกำหนดให้บุคคลอื่นเหล่านั้นต้องมีมาตรการรักษาความมั่นคงปลอดภัยด้านข้อมูลส่วนบุคคลที่เหมาะสม
      กรณีที่มีเหตุจำเป็นต้องส่งหรือโอนข้อมูลส่วนบุคคลของผู้รับบริการไปยังต่างประเทศ
      ผู้ให้บริการจะปฏิบัติตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล
      และใช้มาตรการที่เหมาะสมเพื่อให้มั่นใจได้ว่าข้อมูลส่วนบุคคลของผู้รับบริการจะได้รับความคุ้มครองและผู้รับบริการสามารถใช้สิทธิเกี่ยวกับข้อมูลส่วนบุคคลของผู้รับบริการได้ตามที่กฎหมายกำหนด
      รวมถึงผู้ให้บริการจะกำหนดให้ผู้ที่ได้รับข้อมูลส่วนบุคคลของผู้รับบริการมีมาตรการปกป้องข้อมูลของท่านอย่างเหมาะสม
      และประมวลผลข้อมูลส่วนบุคคลดังกล่าวเท่าที่จำเป็นเท่านั้น
      และดำเนินการเพื่อป้องกันไม่ให้บุคคลอื่นใช้หรือเปิดเผยข้อมูลส่วนบุคคลโดยปราศจากอำนาจโดยมิชอบ
      มาตรการรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคล
      บริษัทตกลงจะจัดให้มีมาตรการรักษาความมั่นคงปลอดภัยที่เหมาะสม
      เพื่อป้องกันการสูญหาย เข้าถึง ใช้ เปลี่ยนแปลง แก้ไข
      หรือเปิดเผยข้อมูลส่วนบุคคลโดยปราศจากอำนาจหรือโดยมิชอบ
      รวมถึงทบทวนมาตรการดังกล่าวเมื่อมีความจำเป็นหรือเมื่อเทคโนโลยีเปลี่ยนแปลงไปเพื่อให้มีประสิทธิภาพในการรักษาความมั่นคงปลอดภัยที่เหมาะสม
      เว้นแต่เป็นข้อยกเว้นตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล
      การเปลี่ยนแปลงประกาศความเป็นส่วนตัว
      ผู้ให้บริการจะดำเนินการการพิจารณาทบทวนประกาศความเป็นส่วนตัวอย่างสม่ำเสมอ
      เพื่อให้สอดคล้องกับแนวทางปฏิบัติ กฎหมาย รวมถึงข้อบังคับที่เกี่ยวข้อง
      หากมีการเปลี่ยนแปลงประกาศความเป็นส่วนตัว
      บริษัทจะแจ้งให้ท่านทราบถึงการแก้ไขเปลี่ยนแปลงพร้อมกับประกาศความเป็นส่วนตัวฉบับปรับปรุง
      ผ่านเว็บไซต์ของบริษัทและช่องทางอื่นที่เหมาะสม ทั้งนี้
      บริษัทขอแนะนำให้ท่านตรวจสอบการเปลี่ยนแปลงประกาศความเป็นส่วนตัวฉบับนี้เป็นระยะ
      ๆ สิทธิของเจ้าของข้อมูล ในฐานะที่ผู้รับบริการเป็นเจ้าของข้อมูลส่วนบุคคล
      ท่านมีสิทธิตามที่กำหนดไว้โดยพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562
      ดังนี้ สิทธิในการเพิกถอนความยินยอม
      ในกรณีที่บริษัทขอความยินยอมจากผู้รับบริการ
      ท่านมีสิทธิในการเพิกถอนความยินยอมในการประมวลผลข้อมูลส่วนบุคคลที่ท่านได้ให้ความยินยอมกับบริษัทได้
      เว้นแต่การเพิกถอนความยินยอมจะมีข้อจำกัดโดยกฎหมายหรือสัญญาที่ให้ประโยชน์แก่ผู้รับบริการ
      ทั้งนี้การเพิกถอนความยินยอมจะไม่ส่งผลกระทบต่อการประมวลผลข้อมูลส่วนบุคคลที่ท่านได้ให้ความยินยอมไปแล้วโดยชอบด้วยกฎหมาย
      สิทธิในการขอเข้าถึงข้อมูลส่วนบุคคล
      ผู้รับบริการมีสิทธิขอเข้าถึงและขอรับสำเนาข้อมูลของซึ่งอยู่ในความรับผิดชอบของบริษัทรวมถึงขอให้บริษัทเปิดเผยการได้มาซึ่งข้อมูลดังกล่าวที่ผู้รับบริการไม่ได้ให้ความยินยอมต่อบริษัทได้
      สิทธิในการขอให้ส่งหรือโอนข้อมูลส่วนบุคคล
      ผู้รับบริการมีสิทธิขอให้บริษัทโอนข้อมูลส่วนบุคคลของผู้รับบริการที่ให้ไว้กับบริษัทได้ตามที่กฎหมายกำหนด
      สิทธิในการคัดค้านการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคล
      ผู้รับบริการมีสิทธิในการคัดค้านการประมวลผลข้อมูลที่เกี่ยวกับท่านสำหรับกรณีการเก็บรวบรวม
      ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลที่เกี่ยวกับตนได้ตามที่กฎหมายกำหนด
      สิทธิในการขอลบข้อมูลส่วนบุคคล
      ผู้รับบริการมีสิทธิขอให้บริษัทลบข้อมูลส่วนบุคคลของท่านตามที่กฎหมายกำหนด
      ทั้งนี้บริษัทอาจเก็บข้อมูลส่วนบุคคลของท่านด้วยระบบอิเล็กทรอนิกส์ซึ่งอาจมีบางระบบที่ไม่สามารถลบข้อมูลได้
      ในกรณีเช่นนั้นบริษัทจะจัดให้มีการทำลายหรือทำให้ข้อมูลดังกล่าวกลายเป็นข้อมูลที่ไม่สามารถระบุตัวตนของผู้รับบริการได้
      ทั้งนี้บริษัทจะต้องเป็นผู้รับผิดชอบค่าใช้จ่ายในกรณีที่เจ้าของข้อมูลขอให้ธุรกิจลบหรือทำลายข้อมูลส่วนบุคคลหรือทำให้ข้อมูลส่วนบุคคลเป็นข้อมูลที่ไม่สามารถระบุตัวตนได้และที่ข้อมูลส่วนบุคคลดังกล่าวถูกนำไปเผยแพร่ในที่สาธารณะ
      สิทธิในการขอให้ระงับการใช้ข้อมูลส่วนบุคคล
      ผู้รับบริการมีสิทธิขอให้บริษัทระงับการใช้ข้อมูลของผู้รับบริการได้ตามที่กฎหมายกำหนด
      สิทธิในการขอแก้ไขข้อมูลส่วนบุคคลให้ถูกต้อง
      กรณีที่ผู้รับบริการเห็นว่าข้อมูลที่บริษัทมีอยู่นั้นไม่ถูกต้องหรือท่านมีการเปลี่ยนแปลงข้อมูลส่วนบุคคลของผู้รับบริการเอง
      ผู้รับบริการมีสิทธิขอให้บริษัทแก้ไขข้อมูลส่วนบุคคลของผู้รับบริการเพื่อให้ข้อมูลส่วนบุคคลดังกล่าวถูกต้อง
      เป็นปัจจุบัน สมบูรณ์ และไม่ก่อให้เกิดความเข้าใจผิด สิทธิในการร้องเรียน
      ผู้รับบริการมีสิทธิในการร้องเรียนต่อพนักงานเจ้าหน้าที่ผู้มีอำนาจตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล
      พ.ศ. 2562 ในกรณีที่บริษัทฝ่าฝืนหรือไม่ปฏิบัติตามพระราชบัญญัติดังกล่าว

    
      ข้อตกลงการให้สิทธิ์การใช้งานสำหรับผู้ใช้แอปพลิเคชัน

      1. การให้สิทธิ์การใช้งาน
      - ผู้พัฒนาให้สิทธิ์การใช้งานแอปพลิเคชันนี้แก่ผู้ใช้ในลักษณะ ไม่ผูกขาด ไม่สามารถโอนสิทธิ์ และสามารถเพิกถอนได้ สำหรับวัตถุประสงค์ส่วนบุคคลหรือทางธุรกิจ ภายใต้เงื่อนไขที่กำหนดไว้ในข้อตกลงฉบับนี้
      - ผู้ใช้ ไม่มีสิทธิ์ในการแจกจ่าย คัดลอก แก้ไข วิศวกรรมย้อนกลับ หรือสร้างแอปพลิเคชันอื่น จากแอปนี้ไม่ว่าทั้งหมดหรือบางส่วน

      2. การจัดเก็บและการใช้งานข้อมูล
      - ข้อมูลที่ผู้ใช้กรอกเข้าสู่ระบบ เช่น ชื่อ หมายเลขโทรศัพท์ ยอดหนี้ และวันครบกำหนดชำระ จะถูกจัดเก็บบนเซิร์ฟเวอร์ของผู้ให้บริการฐานข้อมูล โดยอยู่ภายใต้นโยบายความปลอดภัยและความเป็นส่วนตัวของผู้พัฒนา
      - ผู้ใช้เป็นผู้รับผิดชอบโดยตรงต่อความถูกต้องและความเหมาะสมของข้อมูลทั้งหมดที่กรอกเข้าระบบ
      - ผู้พัฒนา จะไม่ขาย แบ่งปัน หรือเผยแพร่ข้อมูลของผู้ใช้แก่บุคคลภายนอก เว้นแต่จะได้รับความยินยอมอย่างชัดแจ้งจากผู้ใช้ก่อนล่วงหน้า
      3. ความรับผิดชอบของผู้ใช้
      - ผู้ใช้ต้องใช้งานแอปพลิเคชันนี้ ภายใต้กรอบของกฎหมายท้องถิ่นที่เกี่ยวข้อง โดยเฉพาะกฎหมายว่าด้วยการให้กู้ยืมและการติดต่อลูกหนี้ในประเทศของตน
      - ผู้พัฒนา ไม่รับผิดชอบต่อผลกระทบทางกฎหมาย ที่เกิดจากการใช้งานฟีเจอร์ระบบ SMS ทวงหนี้อัตโนมัติของผู้ใช้ โดยผู้ใช้ต้องได้รับความยินยอมจากผู้รับข้อความตามที่กฎหมายกำหนด
      4. บริการและการอัปเดต
      - ผู้พัฒนาอาจดำเนินการอัปเดตแอปพลิเคชันเป็นระยะ เพื่อปรับปรุงฟังก์ชัน ความปลอดภัย และประสบการณ์การใช้งาน
      - ผู้ใช้ตกลงให้สิทธิ์แก่ผู้พัฒนาในการดำเนินการอัปเดตแอปโดยอัตโนมัติหากเห็นว่าจำเป็น
      5. ข้อจำกัดความรับผิด
      - แอปพลิเคชันนี้ให้บริการในลักษณะ "ตามสภาพที่เป็นอยู่" (As-is) โดยไม่มีการรับประกันใด ๆ ทั้งโดยชัดแจ้งหรือโดยนัย รวมถึงแต่ไม่จำกัดเพียง ความถูกต้อง ความเสถียร หรือความเหมาะสมกับวัตถุประสงค์เฉพาะ
      - ผู้พัฒนา ไม่รับผิดชอบต่อความเสียหายใด ๆ ที่เกิดขึ้นจากการใช้งานแอป ไม่ว่าจะโดยตรง โดยอ้อม หรือโดยบังเอิญ
      6. การยกเลิกสิทธิ์การใช้งาน
      - หากผู้ใช้ละเมิดเงื่อนไขในข้อตกลงฉบับนี้ สิทธิ์ในการใช้งานจะถูก เพิกถอนโดยทันที โดยไม่ต้องแจ้งให้ทราบล่วงหน้า
      - การยกเลิกสิทธิ์การใช้งานจะ ไม่ยกเว้นความรับผิดใด ๆ ที่เกิดขึ้นก่อนหน้านั้น
      7. ข้อกฎหมายที่ใช้บังคับ
      - ข้อตกลงฉบับนี้อยู่ภายใต้บังคับของกฎหมายของประเทศที่ผู้พัฒนามีถิ่นที่อยู่ทางธุรกิจ และข้อพิพาทใด ๆ ที่เกิดขึ้นจะต้องพิจารณาโดยศาลที่มีเขตอำนาจตามกฎหมายของประเทศดังกล่าว
      8. ข้อตกลงเพิ่มเติมเกี่ยวกับการส่งข้อความ (SMS)
      - แอปพลิเคชันนี้มีฟีเจอร์สำหรับการส่งข้อความ SMS ไปยังลูกหนี้ตามข้อมูลที่ผู้ใช้กำหนด ผู้ใช้เป็นผู้รับผิดชอบโดยตรงในการตรวจสอบความถูกต้องของข้อมูล และต้องได้รับความยินยอมอย่างชัดแจ้งจากผู้รับข้อความ
      - ผู้พัฒนา ไม่มีส่วนเกี่ยวข้องหรือรับผิดชอบต่อผลทางกฎหมายใด ๆ ที่เกิดจากการส่งข้อความโดยผู้ใช้
      9. ข้อตกลงฉบับสมบูรณ์
      - ข้อตกลงฉบับนี้ถือเป็นข้อตกลงฉบับสมบูรณ์ระหว่างผู้ใช้และผู้พัฒนา หากข้อกำหนดใดในข้อตกลงนี้ถูกตัดสินให้เป็นโมฆะ หรือไม่สามารถบังคับใช้ได้ เงื่อนไขอื่น ๆ ที่เหลือยังคงมีผลบังคับใช้อย่างเต็มที่
      10. การชำระเงินและการสมัครสมาชิก (In-App Purchases and Subscriptions)
      แอปพลิเคชันนี้ให้บริการบางส่วนในรูปแบบของ การสมัครสมาชิกแบบชำระเงิน (Subscription) เพื่อเข้าถึงฟีเจอร์พิเศษ เช่น:
      การส่งข้อความ SMS อัตโนมัติแบบไม่จำกัด
      การสำรองข้อมูลอัตโนมัติ
      การวิเคราะห์รายงานขั้นสูง
      ประเภทของแผนการสมัครสมาชิก
      Small Plan (รายเดือน)
      Medium Plan (รายเดือน)
      Large Plan (รายเดือน)
      การต่ออายุอัตโนมัติ แผนการสมัครสมาชิกทั้งหมดจะต่ออายุโดยอัตโนมัติ เว้นแต่ผู้ใช้ดำเนินการยกเลิกอย่างน้อย 24 ชั่วโมงก่อนถึงวันหมดอายุของรอบปัจจุบัน
      การเรียกเก็บเงิน ค่าบริการจะถูกเรียกเก็บโดย Apple ผ่านบัญชี Apple ID ที่เชื่อมกับ App Store โดยอัตโนมัติ
      การจัดการการสมัครสมาชิก ผู้ใช้สามารถจัดการหรือยกเลิกการสมัครสมาชิกได้ด้วยตนเองผ่าน:
      Settings > Apple ID > Subscriptions
      การยกเลิกการสมัครสมาชิก การยกเลิกจะไม่มีผลย้อนหลัง และผู้ใช้ยังสามารถใช้ฟีเจอร์ที่ชำระเงินแล้วได้จนกว่าจะสิ้นสุดรอบการเรียกเก็บเงินปัจจุบัน
      นโยบายการคืนเงิน การชำระเงินทั้งหมดอยู่ภายใต้นโยบายการคืนเงินของ Apple Inc. หากต้องการขอคืนเงิน ผู้ใช้สามารถดำเนินการได้ผ่าน:
      https://reportaproblem.apple.com
    </>
  ),
  update: "11 เมษายน 2567",
};

const Index = () => {
  const [isBottomReached, setIsBottomReached] = useState(false);
  const [showFeedback, setShowFeedback] = useState(false); // State to control Feedback visibility
  // const router = useRouter();
  // const { social } = useLocalSearchParams(); // Get 'social' parameter
  const user = useUserStore.getState();
  const setUser = useUserStore.getState().setUser;
  const [isError, setIsError] = useState(false);
  const scrollViewRef = useRef(null);

  useEffect(() => {
    // Ensure isBottomReached is reset to false on component mount
    setIsBottomReached(false);
  }, []);

  const handleScroll = ({ nativeEvent }) => {
    const { layoutMeasurement, contentOffset, contentSize } = nativeEvent;
    const isScrolledToBottom =
      layoutMeasurement.height + contentOffset.y >= contentSize.height - 20;

    if (isScrolledToBottom && !isBottomReached) {
      LayoutAnimation.easeInEaseOut();
      setIsBottomReached(true);
    }
  };

  const handleNextPage = async () => {
    if (!isBottomReached) return;

    const formData = new FormData();
    formData.append("file", {
      uri: user.profileImage,
      name: `${Date.now()}.jpg`,
      type: "image/jpeg",
    } as any);

    const response = await Promise.all([
      patchUser({
        storeName: user.storeName,
        phoneNumber: user.phoneNumber,
      }),
      postProfile(formData),
    ]);

    if (response.status === 200) {
      setUser(response.data);
    } else {
      setIsError(true);
    }
    setShowFeedback(true);
  };

  const scrollToBottom = () => {
    if (scrollViewRef.current) {
      scrollViewRef.current.scrollToEnd({ animated: true });
    }
  };

  return (
    <View className="h-full">
      {showFeedback ? (
        <Feedback
          isSuccess={!isError}
          redirect
          redirectUrl="/(tabs)"
          redirectTimer={2000}
        >
          <FeedbackTitle>ตั้งค่าเรียบร้อย!</FeedbackTitle>
          <FeedbackDescription>
            ร้านค้าของคุณพร้อมใช้งานแล้ว
          </FeedbackDescription>
        </Feedback>
      ) : (
        <>
          <SafeAreaView>
            <ScrollView 
              ref={scrollViewRef}
              onScroll={handleScroll} 
              scrollEventThrottle={16}
            >
              <View className={cn(CONTAINER, "px-8")}>
                <View className="flex flex-col gap-4">
                  <View className="flex flex-col gap-1">
                    <Text className={cn(TITLE, "")}>
                      กรุณาพิจรณา{"\n"}นโยบายความเป็นส่วนตัว
                    </Text>
                    <Text className={cn(PARAGRAPH, "text-[#949494]")}>
                      อัปเดตล่าสุด: {demodata.update}
                    </Text>
                  </View>
                  <View>
                    <Text className={cn(PARAGRAPH, "")}>
                      {demodata.description}
                    </Text>
                  </View>
                </View>
              </View>
            </ScrollView>

            {/* Card at the bottom */}
            <View className="flex-1">
              <View className="absolute bottom-0 left-0 right-0 flex items-center">
                <Card className="w-full max-w-sm">
                  <View className="px-4 pt-4 pb-2">
                    <CardDescription
                      className={cn(PARAGRAPH, "text-foreground")}
                    >
                      จากการกด "ยินยอม" เเปลว่าคุณได้ยอมรับเงื้อนไขการใช้งานของ
                      Ok Money
                    </CardDescription>
                  </View>

                  <CardFooter className="justify-between">
                    <IconButton
                      icon={<ArrowLeft />}
                      variant="green"
                      size={"icon-lg"}
                      className="items-center"
                    />

                    <IconButton
                      icon={<ArrowRight />}
                      text="ยอมรับ"
                      variant={isBottomReached ? "default" : "outline"}
                      className="items-center"
                      iconPosition="right"
                      onPress={handleNextPage}
                    />
                  </CardFooter>
                </Card>
              </View>
            </View>

            {/* Scroll to bottom floating button */}
            {!isBottomReached && (
              <View className="absolute bottom-52 right-8">
                <Button
                  variant="secondary"
                  size="icon"
                  className="rounded-full shadow-md"
                  onPress={scrollToBottom}
                >
                  <ArrowDown size={24} color="white" />
                </Button>
              </View>
            )}
          </SafeAreaView>
        </>
      )}
    </View>
  );
};

export default Index;
